#მოგესალმებით.


name = input("What Is Your Name?: ")
input("hello" + name)


#ეხლა ჩვენ უნდა გავაკეთოთ თუ რამდენი წლის ქინება იგი 5 წლის შემდეგ,ვთქვათ ის არის 20 წლის ჩვენ დავწერთ future_age = age +5 ანუ მომავლის ასაკი უდრის ახლანდელ ასაკს დამატებული 5

age = int(input("How Old Are You?: " ))



print(age + 5)









# ჩვენი შემდეგი დავალებაა მომხმარებელს შემოვაყვანინოთ დღეების რაოდენობა და გადავაქციოთ საათებად.ვკითხეთ თუ რადენი დღეა 1 კვირაში მან დააფიქსირა 7 და გამოვთვალეთ 7 დღეში რამდენი საათია

week = str(input("How Many Days In One Week?: " ))

days = 7
hours = 24
print(days * hours)


# შემდეგი დავალებაა ორი რიცხვი გვითხრას მომხმარებელმა და შევინახოთ ცვლადში.უნდა გამოვთვალოთ ჯამი სხვაობა ნამრავლი და განაყოფი.

num1 = int(input("tell me another number: "))

num2 = int(input("also tell me second another number"))

print(num1 + num2, num1 - num2, num1 / num2, num1 * num2)

# ჩვენი შემდეგი დავალებაა მომხმარებელმა გვითხრას 3 ან მეტი რიცხვი და გამოვთვალოთ მათი საშუალო არითმეტიკული.


რიცხვი1 = int(input("შეიყვანეთ პირველი რიცხვი"))
რიცხვი2 = int(input("შეიყვანეთ მეორე რიცხვი"))
რიცხვი3 = int(input("შეიყვანეთ მესამე რიცხვი"))





print((რიცხვი1 + რიცხვი2 + რიცხვი3) / 3)


# პითონმა გამოთვალა ეს ყველაფერი დაუმატა ერთმანეთს და გაყო რაოდენობაზე.


#მადლობა ნახვამდის <3.






