#1

#ჩვენ გაკვეთილზე ვისწავლეთ integer და String
#ასევე ჩვენ შევეხეთ ცვლადებს მაგალითად X და Y ცვლადი,რომ დაწერ x= 5+5 ეს ყველაფერი ინახება RAM მეხსიერებაში უბრალოდ OUTPUT ში არგამოაქვს და როდესაც დაწერ PRINT(x) ეგრევე OUTPUT ში გამოგიტანს შესრულებულ ბრძანებას. მაგალითად:


x= 9+17

y= 7+5

#ეხლა დავწეროთ ბრძანება print(x) და შემდეგ print(y) ამის შემდეგ დავინახავთ რომ Terminalში გამოიტანს ყველაფერს.
print(x)
print(y)

#STRING არის ტექსტი რომელიც აუცილებელია რომ "" პრჭყალებში ჩავწეროთ რადგან ისე არ მიიღებს PYTHON ბრძანებას.სტრინგი არის სიტყვიერი მონაცემი.
#INTEGER არის მთელი რიცხვი
#ცვლადი არშეიძლება იწყებოდეს ციფრით ან რიცხვით. მაგალითან 1X არასწორია X1 სწორია და არუნდა ვიხმაროთ ცვლადში SPACE (MATE MATCHARASHVILI)ეს არასწორია ხოლო ეს სწორია (MATE_MATCHARASHVILI)

#2
u = 5 * 8

i = 16 / 4

o = 10 + 20

p = 18 - 9
print(u)

print(i)

print(o)

print(p)

#3)

width = 50
height = 25

print("ფართობი =",width * height)  #ფართობი
print("პერიმეტრი =", 2 * (width + height ) )



#4) კონკატინაცია არის ორი ან ორზე მეტი სტრინგის ანუ ტექსტური ბრძანების შეერთებას ერთმანეთთან მაგალითად"

სახელი = "Mate "

გვარი = " Matcharashvili"
print(სახელი + გვარი)



#5) უნდა შევქმნათ 3 ცვლადი name,age,height და შიგნით შევინახოთ მონაცემთა მნიშვნელობა და შემდეგ დავპრინტოთ.

name = "Mate"
height = 182

age = 16

print(name)

print(height)

print(age)



